---
kind: type
id: T:Autodesk.Revit.DB.FilterStringRule
source: html/166d75f9-1088-3275-2219-867c1142d8da.htm
---
# Autodesk.Revit.DB.FilterStringRule

A filter rule that operates on string values in a Revit project.

## Syntax (C#)
```csharp
public class FilterStringRule : FilterValueRule
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.